// 简体中文
export default {
    tip: {
        //状态码
        "t201": "网络错误，请刷新重试",//json 格式的请求参数错误，parse_json()返回错误
        "t202": "网络错误，请刷新重试",//json 格式的请求参数，字段不存在或字段类型错误，CHECK_JSON_xxx()返回 false
        "t203": "网络错误，请刷新重试",//参数取值超出有效范围
        "t205": "响应超时，请稍后重试",//服务器内部的逻辑错误
        "t206": "网络错误，请刷新重试",//请求超时
        "t204": "网络错误，请刷新重试",//数据库连接，sql 执行相关错误
        "t207": "网络错误，请刷新重试",//请求参数在业务逻辑上非法，超出服务器处理范围
        "t208": "网络错误，请刷新重试",//请求 body 为空
        "t209": "网络错误，请刷新重试",//请求数据太长
        "t210": "网络错误，请刷新重试",//请求数据太短，不能为 0
        "t211": "网络错误，请刷新重试",//该请求的方法并不存在
        "t212": "非法请求",//非法请求
        "t213": "网络错误，请刷新重试",//tcp 连接错误
        "t214": "未知错误 -200",//未知错误
        "t215": "没有找到用户",//未知错误
        "t216": "操作过于频繁，请60s后重试",//未知错误
        "t217": "参数错误",//未知错误
        "t218": "网络错误，请刷新重试",//未知错误
        "t219": "账号在其他地方登录",//未知错误

        //错误码
        //用户账户服务
        "t1": "登录已过期",
        "t2": "没有找到用户",
        "t3": "点击太快，请60s后重试",
        "t4": "操作过于频繁，请一分钟后再次发送验证码",
        "t5": "短信平台暂未响应，请稍后重试",
        "t6": "验证码错误",
        "t7": "token超时",
        "t8": "电话号码已使用 无法绑定",
        "t9": "电话号码 已经使用",
        "t10": "获取验证码失败,电话号码已经登录",
        "t11": "登录失败，用户已登录",
        "t12": "用户信息查询失败",
        "t13": "客户端更新失败",
        "t14": "登出错误",
        "t15": "客户端传参错误",
        "t16": "原始密码错误",
        "t17": "验证码超时",

        //收益服务
        "t18": "没有查询到数据",
        "t19": "用户不存在",
        "t20": "设备不存在",
        "t21": "查询结束时间不对",
        "t22": "参数错误",

        //传入的参数错误
        "t23": "参数错误",

        //设备控制
        "t100": "网络异常，请刷新重试",//接口调用传参login_token JSON 格式验证错误
        "t101": "网络异常，请刷新重试",//接口调用传参login_token JSON 格式验证错误
        "t102": "网络异常，请刷新重试",//接口调用传参login_token JSON 格式验证错误
        "t103": "网络异常，请刷新重试",//接口调用传参dev_name 字段超长，有效范围为1~240 字节
        "t104": "网络异常，请刷新重试",//接口调用传参dev_name 中使用的字符不是 utf8 编码
        "t105": "网络异常，请刷新重试",//绑定设备更新设备名称接口调用传参bind_user_tel_numJSON 格式验证错误
        "t106": "网络异常，请刷新重试",//接口调用传参bind_user_tel_num 中使用的字符不是 utf8 编码
        "t107": "设备已绑定，请先解绑",//设备已绑定，请先解绑
        "t108": "网络异常，请刷新重试",//请求需要绑定的设备id 在设备字典中找不到
        "t109": "网络异常，请刷新重试",//请求需要绑定的设备sn 未找到
        "t110": "网络异常，请刷新重试",//接口调用传参login_token JSON 格式验证错误
        "t111": "网络异常，请刷新重试",//接口调用传参dev_sn JSON 格式验证错误
        "t112": "网络异常，请刷新重试",//接口调用传参bind_user_tel_numJSON 格式验证错误
        "t113": "设备已绑定，无法再次绑定，先解绑然后再绑定",//
        "t114": "设备已绑定，只有绑定者才能够解绑",//
        "t115": "设备当前处于解绑状态，无法被解绑",//
        "t116": "网络异常，请刷新重试",//设备 sn 对应的设备id 未知
        "t117": "网络异常，请刷新重试",//无法找到指定 id 的设备对象
        "t118": "网络异常，请刷新重试",//接口调用传参dev_sn JSON 格式验证错误
        "t119": "网络异常，请刷新重试",//接口调用传参dev_name JSON 格式验证错误
        "t120": "网络异常，请刷新重试",//接口调用传参dev_name取值超长有效范围     
        "t121": "网络异常，请刷新重试",//接口调用传参dev_name 字符编码不是 utf8
        "t122": "网络异常，请刷新重试",//指定的设备 sn 未知
        "t123": "网络异常，请刷新重试",//指定的设备 id 未知
        "t124": "网络异常，请刷新重试",//接口调用传参 login_token JSON格式验证错误
        "t125": "网络异常，请刷新重试",//无法找到绑定列表的某个设备的数据对象
        "t126": "网络异常，请刷新重试",//用户未绑定任何设备
        "t127": "网络异常，请刷新重试",//接口调用传参login_token JSON格式验证错误
        "t128": "网络异常，请刷新重试",//接口调用传参dev_sn JSON 格式验证错误
        "t129": "网络异常，请刷新重试",//指定的设备 id 未知
        "t130": "网络异常，请刷新重试",//接口调用传参login_token JSON格式验证错误
        "t131": "网络异常，请刷新重试",//接口调用传参login_token JSON格式验证错误
        "t132": "网络异常，请刷新重试",//指定的设备 id 未找到对应的设备信息
        "t133": "网络异常，请刷新重试",//接口调用传参login_token JSON格式验证错误
        "t134": "网络异常，请刷新重试",//接口调用传参start_timestampJSON格式验证错误
        "t135": "网络异常，请刷新重试",//接口调用传参end_timestampJSON格式验证错误
        "t136": "网络异常，请刷新重试",//指定的用户未知
        "t137": "网络异常，请刷新重试",//用户未绑定任何设备
        "t138": "账户已被冻结",//用户未绑定任何设备
    },
    login_code: {
        title: "验证码"
    }
};